tutorials/channelFlow/slipLengthLp0.01_Lm0.01/Ny5/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 0.01;
        wallVelocity    uniform (0 0 0);
    }

    bottomWall 
    {
        type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 0.01;
        wallVelocity    uniform (0 0 0);
    }

    inFlow 
    {
        type            zeroGradient;
    }

    outFlow
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
