tutorials/channelFlow/slipLengthLp0.01_Lm0.01/Ny5/Allrun
#!/bin/sh

cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions


runApplication blockMesh
runApplication $(getApplication)

#./Alleval
